Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_pwm.h
/****************************************************************************
 *
 * Copyright 2016 Samsung Electronics All Rights Reserved.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
 * either express or implied. See the License for the specific
 * language governing permissions and limitations under the License.
 *
 ****************************************************************************/
/****************************************************************************
 * os/arch/arm/src/imxrt/imxrt_pwm.h
 *
 *   Copyright (C) 2013-2014 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * The Samsung sample code has a BSD compatible license that requires this
 * copyright notice:
 *
 *   Copyright (c) 2016 Samsung Electronics, Inc.
 *   All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 */

#ifndef	__ARCH_ARM_SRC_IMXRT_IMXRT_PWM_H
#define	__ARCH_ARM_SRC_IMXRT_IMXRT_PWM_H

/****************************************************************************
 * Included Files
 ****************************************************************************/
#include <tinyara/config.h>

#include <tinyara/pwm.h>

#include "imxrt_config.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
#define FSL_PWM_DRIVER_VERSION (MAKE_VERSION(2, 0, 0)) /*!< Version 2.0.0 */
/*@}*/

/*! Number of bits per submodule for software output control */
#define PWM_SUBMODULE_SWCONTROL_WIDTH 2

/*! @brief List of PWM submodules */
typedef enum _pwm_submodule {
	kPWM_Module_0 = 0U, /*!< Submodule 0 */
	kPWM_Module_1,      /*!< Submodule 1 */
	kPWM_Module_2,      /*!< Submodule 2 */
	kPWM_Module_3       /*!< Submodule 3 */
} pwm_submodule_t;

/*! @brief List of PWM channels in each module */
typedef enum _pwm_channels {
	kPWM_PwmB = 0U,
	kPWM_PwmA,
	kPWM_PwmX
} pwm_channels_t;

/*! @brief List of PWM value registers */
typedef enum _pwm_value_register {
	kPWM_ValueRegister_0 = 0U, /*!< PWM Value0 register */
	kPWM_ValueRegister_1,      /*!< PWM Value1 register */
	kPWM_ValueRegister_2,      /*!< PWM Value2 register */
	kPWM_ValueRegister_3,      /*!< PWM Value3 register */
	kPWM_ValueRegister_4,      /*!< PWM Value4 register */
	kPWM_ValueRegister_5       /*!< PWM Value5 register */
} pwm_value_register_t;

/*! @brief PWM clock source selection.*/
typedef enum _pwm_clock_source {
	kPWM_BusClock = 0U,  /*!< The IPBus clock is used as the clock */
	kPWM_ExternalClock,  /*!< EXT_CLK is used as the clock */
	kPWM_Submodule0Clock /*!< Clock of the submodule 0 (AUX_CLK) is used as the source clock */
} pwm_clock_source_t;

/*! @brief PWM prescaler factor selection for clock source*/
typedef enum _pwm_clock_prescale {
	kPWM_Prescale_Divide_1 = 0U, /*!< PWM clock frequency = fclk/1 */
	kPWM_Prescale_Divide_2,      /*!< PWM clock frequency = fclk/2 */
	kPWM_Prescale_Divide_4,      /*!< PWM clock frequency = fclk/4 */
	kPWM_Prescale_Divide_8,      /*!< PWM clock frequency = fclk/8 */
	kPWM_Prescale_Divide_16,     /*!< PWM clock frequency = fclk/16 */
	kPWM_Prescale_Divide_32,     /*!< PWM clock frequency = fclk/32 */
	kPWM_Prescale_Divide_64,     /*!< PWM clock frequency = fclk/64 */
	kPWM_Prescale_Divide_128     /*!< PWM clock frequency = fclk/128 */
} pwm_clock_prescale_t;

/*! @brief Options that can trigger a PWM FORCE_OUT */
typedef enum _pwm_force_output_trigger {
	kPWM_Force_Local = 0U,   /*!< The local force signal, CTRL2[FORCE], from the submodule is used to force updates */
	kPWM_Force_Master,       /*!< The master force signal from submodule 0 is used to force updates */
	kPWM_Force_LocalReload,  /*!< The local reload signal from this submodule is used to force updates without regard to
								the state of LDOK */
	kPWM_Force_MasterReload, /*!< The master reload signal from submodule 0 is used to force updates if LDOK is set */
	kPWM_Force_LocalSync,    /*!< The local sync signal from this submodule is used to force updates */
	kPWM_Force_MasterSync,   /*!< The master sync signal from submodule0 is used to force updates */
	kPWM_Force_External,     /*!< The external force signal, EXT_FORCE, from outside the PWM module causes updates */
	kPWM_Force_ExternalSync  /*!< The external sync signal, EXT_SYNC, from outside the PWM module causes updates */
} pwm_force_output_trigger_t;

