Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_pwm.h
/*! @brief PWM counter initialization options */
typedef enum _pwm_init_source {
	kPWM_Initialize_LocalSync = 0U, /*!< Local sync causes initialization */
	kPWM_Initialize_MasterReload,   /*!< Master reload from submodule 0 causes initialization */
	kPWM_Initialize_MasterSync,     /*!< Master sync from submodule 0 causes initialization */
	kPWM_Initialize_ExtSync         /*!< EXT_SYNC causes initialization */
} pwm_init_source_t;

/*! @brief PWM load frequency selection */
typedef enum _pwm_load_frequency {
	kPWM_LoadEveryOportunity = 0U, /*!< Every PWM opportunity */
	kPWM_LoadEvery2Oportunity,     /*!< Every 2 PWM opportunities */
	kPWM_LoadEvery3Oportunity,     /*!< Every 3 PWM opportunities */
	kPWM_LoadEvery4Oportunity,     /*!< Every 4 PWM opportunities */
	kPWM_LoadEvery5Oportunity,     /*!< Every 5 PWM opportunities */
	kPWM_LoadEvery6Oportunity,     /*!< Every 6 PWM opportunities */
	kPWM_LoadEvery7Oportunity,     /*!< Every 7 PWM opportunities */
	kPWM_LoadEvery8Oportunity,     /*!< Every 8 PWM opportunities */
	kPWM_LoadEvery9Oportunity,     /*!< Every 9 PWM opportunities */
	kPWM_LoadEvery10Oportunity,    /*!< Every 10 PWM opportunities */
	kPWM_LoadEvery11Oportunity,    /*!< Every 11 PWM opportunities */
	kPWM_LoadEvery12Oportunity,    /*!< Every 12 PWM opportunities */
	kPWM_LoadEvery13Oportunity,    /*!< Every 13 PWM opportunities */
	kPWM_LoadEvery14Oportunity,    /*!< Every 14 PWM opportunities */
	kPWM_LoadEvery15Oportunity,    /*!< Every 15 PWM opportunities */
	kPWM_LoadEvery16Oportunity     /*!< Every 16 PWM opportunities */
} pwm_load_frequency_t;

/*! @brief List of PWM fault selections */
typedef enum _pwm_fault_input {
	kPWM_Fault_0 = 0U, /*!< Fault 0 input pin */
	kPWM_Fault_1,      /*!< Fault 1 input pin */
	kPWM_Fault_2,      /*!< Fault 2 input pin */
	kPWM_Fault_3       /*!< Fault 3 input pin */
} pwm_fault_input_t;

/*! @brief PWM capture edge select */
typedef enum _pwm_input_capture_edge {
	kPWM_Disable = 0U,   /*!< Disabled */
	kPWM_FallingEdge,    /*!< Capture on falling edge only */
	kPWM_RisingEdge,     /*!< Capture on rising edge only */
	kPWM_RiseAndFallEdge /*!< Capture on rising or falling edge */
} pwm_input_capture_edge_t;

/*! @brief PWM output options when a FORCE_OUT signal is asserted */
typedef enum _pwm_force_signal {
	kPWM_UsePwm = 0U,     /*!< Generated PWM signal is used by the deadtime logic.*/
	kPWM_InvertedPwm,     /*!< Inverted PWM signal is used by the deadtime logic.*/
	kPWM_SoftwareControl, /*!< Software controlled value is used by the deadtime logic. */
	kPWM_UseExternal      /*!< PWM_EXTA signal is used by the deadtime logic. */
} pwm_force_signal_t;

/*! @brief Options available for the PWM A & B pair operation */
typedef enum _pwm_chnl_pair_operation {
	kPWM_Independent = 0U,  /*!< PWM A & PWM B operate as 2 independent channels */
	kPWM_ComplementaryPwmA, /*!< PWM A & PWM B are complementary channels, PWM A generates the signal */
	kPWM_ComplementaryPwmB  /*!< PWM A & PWM B are complementary channels, PWM B generates the signal */
} pwm_chnl_pair_operation_t;

/*! @brief Options available on how to load the buffered-registers with new values */
typedef enum _pwm_register_reload {
	kPWM_ReloadImmediate = 0U,     /*!< Buffered-registers get loaded with new values as soon as LDOK bit is set */
	kPWM_ReloadPwmHalfCycle,       /*!< Registers loaded on a PWM half cycle */
	kPWM_ReloadPwmFullCycle,       /*!< Registers loaded on a PWM full cycle */
	kPWM_ReloadPwmHalfAndFullCycle /*!< Registers loaded on a PWM half & full cycle */
} pwm_register_reload_t;

/*! @brief Options available on how to re-enable the PWM output when recovering from a fault */
typedef enum _pwm_fault_recovery_mode {
	kPWM_NoRecovery = 0U,        /*!< PWM output will stay inactive */
	kPWM_RecoverHalfCycle,       /*!< PWM output re-enabled at the first half cycle */
	kPWM_RecoverFullCycle,       /*!< PWM output re-enabled at the first full cycle */
	kPWM_RecoverHalfAndFullCycle /*!< PWM output re-enabled at the first half or full cycle */
} pwm_fault_recovery_mode_t;

/*! @brief List of PWM interrupt options */
typedef enum _pwm_interrupt_enable {
	kPWM_CompareVal0InterruptEnable = (1U << 0),  /*!< PWM VAL0 compare interrupt */
	kPWM_CompareVal1InterruptEnable = (1U << 1),  /*!< PWM VAL1 compare interrupt */
	kPWM_CompareVal2InterruptEnable = (1U << 2),  /*!< PWM VAL2 compare interrupt */
	kPWM_CompareVal3InterruptEnable = (1U << 3),  /*!< PWM VAL3 compare interrupt */
	kPWM_CompareVal4InterruptEnable = (1U << 4),  /*!< PWM VAL4 compare interrupt */
	kPWM_CompareVal5InterruptEnable = (1U << 5),  /*!< PWM VAL5 compare interrupt */
	kPWM_CaptureX0InterruptEnable = (1U << 6),    /*!< PWM capture X0 interrupt */
	kPWM_CaptureX1InterruptEnable = (1U << 7),    /*!< PWM capture X1 interrupt */
	kPWM_CaptureB0InterruptEnable = (1U << 8),    /*!< PWM capture B0 interrupt */
	kPWM_CaptureB1InterruptEnable = (1U << 9),    /*!< PWM capture B1 interrupt */
	kPWM_CaptureA0InterruptEnable = (1U << 10),   /*!< PWM capture A0 interrupt */
	kPWM_CaptureA1InterruptEnable = (1U << 11),   /*!< PWM capture A1 interrupt */
	kPWM_ReloadInterruptEnable = (1U << 12),      /*!< PWM reload interrupt */
	kPWM_ReloadErrorInterruptEnable = (1U << 13), /*!< PWM reload error interrupt */
	kPWM_Fault0InterruptEnable = (1U << 16),      /*!< PWM fault 0 interrupt */
	kPWM_Fault1InterruptEnable = (1U << 17),      /*!< PWM fault 1 interrupt */
	kPWM_Fault2InterruptEnable = (1U << 18),      /*!< PWM fault 2 interrupt */
	kPWM_Fault3InterruptEnable = (1U << 19)       /*!< PWM fault 3 interrupt */
} pwm_interrupt_enable_t;

/*! @brief List of PWM status flags */
typedef enum _pwm_status_flags {
	kPWM_CompareVal0Flag = (1U << 0),  /*!< PWM VAL0 compare flag */
	kPWM_CompareVal1Flag = (1U << 1),  /*!< PWM VAL1 compare flag */
	kPWM_CompareVal2Flag = (1U << 2),  /*!< PWM VAL2 compare flag */
	kPWM_CompareVal3Flag = (1U << 3),  /*!< PWM VAL3 compare flag */
	kPWM_CompareVal4Flag = (1U << 4),  /*!< PWM VAL4 compare flag */
	kPWM_CompareVal5Flag = (1U << 5),  /*!< PWM VAL5 compare flag */
	kPWM_CaptureX0Flag = (1U << 6),    /*!< PWM capture X0 flag */
	kPWM_CaptureX1Flag = (1U << 7),    /*!< PWM capture X1 flag */
	kPWM_CaptureB0Flag = (1U << 8),    /*!< PWM capture B0 flag */
	kPWM_CaptureB1Flag = (1U << 9),    /*!< PWM capture B1 flag */
	kPWM_CaptureA0Flag = (1U << 10),   /*!< PWM capture A0 flag */
	kPWM_CaptureA1Flag = (1U << 11),   /*!< PWM capture A1 flag */
	kPWM_ReloadFlag = (1U << 12),      /*!< PWM reload flag */
	kPWM_ReloadErrorFlag = (1U << 13), /*!< PWM reload error flag */
	kPWM_RegUpdatedFlag = (1U << 14),  /*!< PWM registers updated flag */
	kPWM_Fault0Flag = (1U << 16),      /*!< PWM fault 0 flag */
	kPWM_Fault1Flag = (1U << 17),      /*!< PWM fault 1 flag */
	kPWM_Fault2Flag = (1U << 18),      /*!< PWM fault 2 flag */
	kPWM_Fault3Flag = (1U << 19)       /*!< PWM fault 3 flag */
} pwm_status_flags_t;

/*! @brief PWM operation mode */
typedef enum _pwm_mode {
	kPWM_SignedCenterAligned = 0U, /*!< Signed center-aligned */
	kPWM_CenterAligned,            /*!< Unsigned cente-aligned */
	kPWM_SignedEdgeAligned,        /*!< Signed edge-aligned */
	kPWM_EdgeAligned               /*!< Unsigned edge-aligned */
} pwm_mode_t;

/*! @brief PWM output pulse mode, high-true or low-true */
typedef enum _pwm_level_select {
	kPWM_HighTrue = 0U, /*!< High level represents "on" or "active" state */
	kPWM_LowTrue        /*!< Low level represents "on" or "active" state */
} pwm_level_select_t;

/*! @brief PWM reload source select */
typedef enum _pwm_reload_source_select {
	kPWM_LocalReload = 0U, /*!< The local reload signal is used to reload registers */
	kPWM_MasterReload      /*!< The master reload signal (from submodule 0) is used to reload */
} pwm_reload_source_select_t;

/*! @brief PWM fault clearing options */
typedef enum _pwm_fault_clear {
	kPWM_Automatic = 0U, /*!< Automatic fault clearing  */
	kPWM_ManualNormal,   /*!< Manual fault clearing with no fault safety mode */
	kPWM_ManualSafety    /*!< Manual fault clearing with fault safety mode */
} pwm_fault_clear_t;

/*! @brief Options for submodule master control operation */
typedef enum _pwm_module_control {
	kPWM_Control_Module_0 = (1U << 0), /*!< Control submodule 0's start/stop,buffer reload operation */
	kPWM_Control_Module_1 = (1U << 1), /*!< Control submodule 1's start/stop,buffer reload operation */
	kPWM_Control_Module_2 = (1U << 2), /*!< Control submodule 2's start/stop,buffer reload operation */
	kPWM_Control_Module_3 = (1U << 3)  /*!< Control submodule 3's start/stop,buffer reload operation */
} pwm_module_control_t;

/*! @brief Structure for the user to define the PWM signal characteristics */
typedef struct _pwm_signal_param {
	pwm_channels_t pwmChannel; /*!< PWM channel being configured; PWM A or PWM B */
	uint16_t dutyCycle;  /*!< PWM pulse width, value should be between 0 to 100
									0=inactive signal(0% duty cycle)...
									100=always active signal (100% duty cycle)*/
	pwm_level_select_t level;  /*!< PWM output active level select */
	uint16_t deadtimeValue;    /*!< The deadtime value; only used if channel pair is operating in complementary mode */
} pwm_signal_param_t;

/*!
 * @brief PWM config structure
 *
 * This structure holds the configuration settings for the PWM peripheral. To initialize this
 * structure to reasonable defaults, call the PWM_GetDefaultConfig() function and pass a
 * pointer to your config structure instance.
 *
 * The config struct can be made const so it resides in flash
 */
typedef struct _pwm_config {
	bool enableDebugMode;                    /*!< true: PWM continues to run in debug mode;
													false: PWM is paused in debug mode */
	bool enableWait;                         /*!< true: PWM continues to run in WAIT mode;
													false: PWM is paused in WAIT mode */
	uint8_t faultFilterCount;                /*!< Fault filter count */
	uint8_t faultFilterPeriod;               /*!< Fault filter period;value of 0 will bypass the filter */
	pwm_init_source_t initializationControl; /*!< Option to initialize the counter */
	pwm_clock_source_t clockSource;          /*!< Clock source for the counter */
	pwm_clock_prescale_t prescale;           /*!< Pre-scaler to divide down the clock */
	pwm_chnl_pair_operation_t pairOperation; /*!< Channel pair in indepedent or complementary mode */
	pwm_register_reload_t reloadLogic;       /*!< PWM Reload logic setup */
	pwm_reload_source_select_t reloadSelect; /*!< Reload source select */
	pwm_load_frequency_t reloadFrequency;    /*!< Specifies when to reload, used when user's choice
													is not immediate reload */
	pwm_force_output_trigger_t forceTrigger; /*!< Specify which signal will trigger a FORCE_OUT */
} pwm_config_t;

/*! @brief Structure is used to hold the parameters to configure a PWM fault */
typedef struct _pwm_fault_param {
	pwm_fault_clear_t faultClearingMode;   /*!< Fault clearing mode to use */
	bool faultLevel;                       /*!< true: Logic 1 indicates fault;
												false: Logic 0 indicates fault */
	bool enableCombinationalPath;          /*!< true: Combinational Path from fault input is enabled;
												false: No combination path is available */
	pwm_fault_recovery_mode_t recoverMode; /*!< Specify when to re-enable the PWM output */
} pwm_fault_param_t;

/*!
 * @brief Structure is used to hold parameters to configure the capture capability of a signal pin
 */
typedef struct _pwm_input_capture_param {
	bool captureInputSel;           /*!< true: Use the edge counter signal as source
											false: Use the raw input signal from the pin as source */
	uint8_t edgeCompareValue;       /*!< Compare value, used only if edge counter is used as source */
	pwm_input_capture_edge_t edge0; /*!< Specify which edge causes a capture for input circuitry 0 */
	pwm_input_capture_edge_t edge1; /*!< Specify which edge causes a capture for input circuitry 1 */
	bool enableOneShotCapture;      /*!< true: Use one-shot capture mode;
											false: Use free-running capture mode */
	uint8_t fifoWatermark;          /*!< Watermark level for capture FIFO. The capture flags in
											the status register will set if the word count in the FIFO
											is greater than this watermark level */
} pwm_input_capture_param_t;

